Microchip-MPLAB-Harmony/csp/apps/ccl/manchester_encoder/firmware/src/packs/ATSAMC21N18A_DFP/component/can.h
#define CAN_IE_RF0NE_Pos                      _U_(0)                                               /**< (CAN_IE) Rx FIFO 0 New Message Interrupt Enable Position */
#define CAN_IE_RF0NE_Msk                      (_U_(0x1) << CAN_IE_RF0NE_Pos)                       /**< (CAN_IE) Rx FIFO 0 New Message Interrupt Enable Mask */
#define CAN_IE_RF0NE(value)                   (CAN_IE_RF0NE_Msk & ((value) << CAN_IE_RF0NE_Pos))  
#define CAN_IE_RF0WE_Pos                      _U_(1)                                               /**< (CAN_IE) Rx FIFO 0 Watermark Reached Interrupt Enable Position */
#define CAN_IE_RF0WE_Msk                      (_U_(0x1) << CAN_IE_RF0WE_Pos)                       /**< (CAN_IE) Rx FIFO 0 Watermark Reached Interrupt Enable Mask */
#define CAN_IE_RF0WE(value)                   (CAN_IE_RF0WE_Msk & ((value) << CAN_IE_RF0WE_Pos))  
#define CAN_IE_RF0FE_Pos                      _U_(2)                                               /**< (CAN_IE) Rx FIFO 0 Full Interrupt Enable Position */
#define CAN_IE_RF0FE_Msk                      (_U_(0x1) << CAN_IE_RF0FE_Pos)                       /**< (CAN_IE) Rx FIFO 0 Full Interrupt Enable Mask */
#define CAN_IE_RF0FE(value)                   (CAN_IE_RF0FE_Msk & ((value) << CAN_IE_RF0FE_Pos))  
#define CAN_IE_RF0LE_Pos                      _U_(3)                                               /**< (CAN_IE) Rx FIFO 0 Message Lost Interrupt Enable Position */
#define CAN_IE_RF0LE_Msk                      (_U_(0x1) << CAN_IE_RF0LE_Pos)                       /**< (CAN_IE) Rx FIFO 0 Message Lost Interrupt Enable Mask */
#define CAN_IE_RF0LE(value)                   (CAN_IE_RF0LE_Msk & ((value) << CAN_IE_RF0LE_Pos))  
#define CAN_IE_RF1NE_Pos                      _U_(4)                                               /**< (CAN_IE) Rx FIFO 1 New Message Interrupt Enable Position */
#define CAN_IE_RF1NE_Msk                      (_U_(0x1) << CAN_IE_RF1NE_Pos)                       /**< (CAN_IE) Rx FIFO 1 New Message Interrupt Enable Mask */
#define CAN_IE_RF1NE(value)                   (CAN_IE_RF1NE_Msk & ((value) << CAN_IE_RF1NE_Pos))  
#define CAN_IE_RF1WE_Pos                      _U_(5)                                               /**< (CAN_IE) Rx FIFO 1 Watermark Reached Interrupt Enable Position */
#define CAN_IE_RF1WE_Msk                      (_U_(0x1) << CAN_IE_RF1WE_Pos)                       /**< (CAN_IE) Rx FIFO 1 Watermark Reached Interrupt Enable Mask */
#define CAN_IE_RF1WE(value)                   (CAN_IE_RF1WE_Msk & ((value) << CAN_IE_RF1WE_Pos))  
#define CAN_IE_RF1FE_Pos                      _U_(6)                                               /**< (CAN_IE) Rx FIFO 1 FIFO Full Interrupt Enable Position */
#define CAN_IE_RF1FE_Msk                      (_U_(0x1) << CAN_IE_RF1FE_Pos)                       /**< (CAN_IE) Rx FIFO 1 FIFO Full Interrupt Enable Mask */
#define CAN_IE_RF1FE(value)                   (CAN_IE_RF1FE_Msk & ((value) << CAN_IE_RF1FE_Pos))  
#define CAN_IE_RF1LE_Pos                      _U_(7)                                               /**< (CAN_IE) Rx FIFO 1 Message Lost Interrupt Enable Position */
#define CAN_IE_RF1LE_Msk                      (_U_(0x1) << CAN_IE_RF1LE_Pos)                       /**< (CAN_IE) Rx FIFO 1 Message Lost Interrupt Enable Mask */
#define CAN_IE_RF1LE(value)                   (CAN_IE_RF1LE_Msk & ((value) << CAN_IE_RF1LE_Pos))  
#define CAN_IE_HPME_Pos                       _U_(8)                                               /**< (CAN_IE) High Priority Message Interrupt Enable Position */
#define CAN_IE_HPME_Msk                       (_U_(0x1) << CAN_IE_HPME_Pos)                        /**< (CAN_IE) High Priority Message Interrupt Enable Mask */
#define CAN_IE_HPME(value)                    (CAN_IE_HPME_Msk & ((value) << CAN_IE_HPME_Pos))    
#define CAN_IE_TCE_Pos                        _U_(9)                                               /**< (CAN_IE) Timestamp Completed Interrupt Enable Position */
#define CAN_IE_TCE_Msk                        (_U_(0x1) << CAN_IE_TCE_Pos)                         /**< (CAN_IE) Timestamp Completed Interrupt Enable Mask */
#define CAN_IE_TCE(value)                     (CAN_IE_TCE_Msk & ((value) << CAN_IE_TCE_Pos))      
#define CAN_IE_TCFE_Pos                       _U_(10)                                              /**< (CAN_IE) Transmission Cancellation Finished Interrupt Enable Position */
#define CAN_IE_TCFE_Msk                       (_U_(0x1) << CAN_IE_TCFE_Pos)                        /**< (CAN_IE) Transmission Cancellation Finished Interrupt Enable Mask */
#define CAN_IE_TCFE(value)                    (CAN_IE_TCFE_Msk & ((value) << CAN_IE_TCFE_Pos))    
#define CAN_IE_TFEE_Pos                       _U_(11)                                              /**< (CAN_IE) Tx FIFO Empty Interrupt Enable Position */
#define CAN_IE_TFEE_Msk                       (_U_(0x1) << CAN_IE_TFEE_Pos)                        /**< (CAN_IE) Tx FIFO Empty Interrupt Enable Mask */
#define CAN_IE_TFEE(value)                    (CAN_IE_TFEE_Msk & ((value) << CAN_IE_TFEE_Pos))    
#define CAN_IE_TEFNE_Pos                      _U_(12)                                              /**< (CAN_IE) Tx Event FIFO New Entry Interrupt Enable Position */
#define CAN_IE_TEFNE_Msk                      (_U_(0x1) << CAN_IE_TEFNE_Pos)                       /**< (CAN_IE) Tx Event FIFO New Entry Interrupt Enable Mask */
#define CAN_IE_TEFNE(value)                   (CAN_IE_TEFNE_Msk & ((value) << CAN_IE_TEFNE_Pos))  
#define CAN_IE_TEFWE_Pos                      _U_(13)                                              /**< (CAN_IE) Tx Event FIFO Watermark Reached Interrupt Enable Position */
#define CAN_IE_TEFWE_Msk                      (_U_(0x1) << CAN_IE_TEFWE_Pos)                       /**< (CAN_IE) Tx Event FIFO Watermark Reached Interrupt Enable Mask */
#define CAN_IE_TEFWE(value)                   (CAN_IE_TEFWE_Msk & ((value) << CAN_IE_TEFWE_Pos))  
#define CAN_IE_TEFFE_Pos                      _U_(14)                                              /**< (CAN_IE) Tx Event FIFO Full Interrupt Enable Position */
#define CAN_IE_TEFFE_Msk                      (_U_(0x1) << CAN_IE_TEFFE_Pos)                       /**< (CAN_IE) Tx Event FIFO Full Interrupt Enable Mask */
#define CAN_IE_TEFFE(value)                   (CAN_IE_TEFFE_Msk & ((value) << CAN_IE_TEFFE_Pos))  
#define CAN_IE_TEFLE_Pos                      _U_(15)                                              /**< (CAN_IE) Tx Event FIFO Element Lost Interrupt Enable Position */
#define CAN_IE_TEFLE_Msk                      (_U_(0x1) << CAN_IE_TEFLE_Pos)                       /**< (CAN_IE) Tx Event FIFO Element Lost Interrupt Enable Mask */
#define CAN_IE_TEFLE(value)                   (CAN_IE_TEFLE_Msk & ((value) << CAN_IE_TEFLE_Pos))  
#define CAN_IE_TSWE_Pos                       _U_(16)                                              /**< (CAN_IE) Timestamp Wraparound Interrupt Enable Position */
#define CAN_IE_TSWE_Msk                       (_U_(0x1) << CAN_IE_TSWE_Pos)                        /**< (CAN_IE) Timestamp Wraparound Interrupt Enable Mask */
#define CAN_IE_TSWE(value)                    (CAN_IE_TSWE_Msk & ((value) << CAN_IE_TSWE_Pos))    
#define CAN_IE_MRAFE_Pos                      _U_(17)                                              /**< (CAN_IE) Message RAM Access Failure Interrupt Enable Position */
#define CAN_IE_MRAFE_Msk                      (_U_(0x1) << CAN_IE_MRAFE_Pos)                       /**< (CAN_IE) Message RAM Access Failure Interrupt Enable Mask */
#define CAN_IE_MRAFE(value)                   (CAN_IE_MRAFE_Msk & ((value) << CAN_IE_MRAFE_Pos))  
#define CAN_IE_TOOE_Pos                       _U_(18)                                              /**< (CAN_IE) Timeout Occurred Interrupt Enable Position */
#define CAN_IE_TOOE_Msk                       (_U_(0x1) << CAN_IE_TOOE_Pos)                        /**< (CAN_IE) Timeout Occurred Interrupt Enable Mask */
#define CAN_IE_TOOE(value)                    (CAN_IE_TOOE_Msk & ((value) << CAN_IE_TOOE_Pos))    
#define CAN_IE_DRXE_Pos                       _U_(19)                                              /**< (CAN_IE) Message stored to Dedicated Rx Buffer Interrupt Enable Position */
#define CAN_IE_DRXE_Msk                       (_U_(0x1) << CAN_IE_DRXE_Pos)                        /**< (CAN_IE) Message stored to Dedicated Rx Buffer Interrupt Enable Mask */
#define CAN_IE_DRXE(value)                    (CAN_IE_DRXE_Msk & ((value) << CAN_IE_DRXE_Pos))    
#define CAN_IE_BECE_Pos                       _U_(20)                                              /**< (CAN_IE) Bit Error Corrected Interrupt Enable Position */
#define CAN_IE_BECE_Msk                       (_U_(0x1) << CAN_IE_BECE_Pos)                        /**< (CAN_IE) Bit Error Corrected Interrupt Enable Mask */
#define CAN_IE_BECE(value)                    (CAN_IE_BECE_Msk & ((value) << CAN_IE_BECE_Pos))    
#define CAN_IE_BEUE_Pos                       _U_(21)                                              /**< (CAN_IE) Bit Error Uncorrected Interrupt Enable Position */
#define CAN_IE_BEUE_Msk                       (_U_(0x1) << CAN_IE_BEUE_Pos)                        /**< (CAN_IE) Bit Error Uncorrected Interrupt Enable Mask */
#define CAN_IE_BEUE(value)                    (CAN_IE_BEUE_Msk & ((value) << CAN_IE_BEUE_Pos))    
#define CAN_IE_ELOE_Pos                       _U_(22)                                              /**< (CAN_IE) Error Logging Overflow Interrupt Enable Position */
#define CAN_IE_ELOE_Msk                       (_U_(0x1) << CAN_IE_ELOE_Pos)                        /**< (CAN_IE) Error Logging Overflow Interrupt Enable Mask */
#define CAN_IE_ELOE(value)                    (CAN_IE_ELOE_Msk & ((value) << CAN_IE_ELOE_Pos))    
#define CAN_IE_EPE_Pos                        _U_(23)                                              /**< (CAN_IE) Error Passive Interrupt Enable Position */
#define CAN_IE_EPE_Msk                        (_U_(0x1) << CAN_IE_EPE_Pos)                         /**< (CAN_IE) Error Passive Interrupt Enable Mask */
#define CAN_IE_EPE(value)                     (CAN_IE_EPE_Msk & ((value) << CAN_IE_EPE_Pos))      
#define CAN_IE_EWE_Pos                        _U_(24)                                              /**< (CAN_IE) Warning Status Interrupt Enable Position */
#define CAN_IE_EWE_Msk                        (_U_(0x1) << CAN_IE_EWE_Pos)                         /**< (CAN_IE) Warning Status Interrupt Enable Mask */
#define CAN_IE_EWE(value)                     (CAN_IE_EWE_Msk & ((value) << CAN_IE_EWE_Pos))      
#define CAN_IE_BOE_Pos                        _U_(25)                                              /**< (CAN_IE) Bus_Off Status Interrupt Enable Position */
#define CAN_IE_BOE_Msk                        (_U_(0x1) << CAN_IE_BOE_Pos)                         /**< (CAN_IE) Bus_Off Status Interrupt Enable Mask */
#define CAN_IE_BOE(value)                     (CAN_IE_BOE_Msk & ((value) << CAN_IE_BOE_Pos))      
#define CAN_IE_WDIE_Pos                       _U_(26)                                              /**< (CAN_IE) Watchdog Interrupt Interrupt Enable Position */
#define CAN_IE_WDIE_Msk                       (_U_(0x1) << CAN_IE_WDIE_Pos)                        /**< (CAN_IE) Watchdog Interrupt Interrupt Enable Mask */
#define CAN_IE_WDIE(value)                    (CAN_IE_WDIE_Msk & ((value) << CAN_IE_WDIE_Pos))    
#define CAN_IE_PEAE_Pos                       _U_(27)                                              /**< (CAN_IE) Protocol Error in Arbitration Phase Enable Position */
#define CAN_IE_PEAE_Msk                       (_U_(0x1) << CAN_IE_PEAE_Pos)                        /**< (CAN_IE) Protocol Error in Arbitration Phase Enable Mask */
#define CAN_IE_PEAE(value)                    (CAN_IE_PEAE_Msk & ((value) << CAN_IE_PEAE_Pos))    
#define CAN_IE_PEDE_Pos                       _U_(28)                                              /**< (CAN_IE) Protocol Error in Data Phase Enable Position */
#define CAN_IE_PEDE_Msk                       (_U_(0x1) << CAN_IE_PEDE_Pos)                        /**< (CAN_IE) Protocol Error in Data Phase Enable Mask */
#define CAN_IE_PEDE(value)                    (CAN_IE_PEDE_Msk & ((value) << CAN_IE_PEDE_Pos))    
#define CAN_IE_ARAE_Pos                       _U_(29)                                              /**< (CAN_IE) Access to Reserved Address Enable Position */
#define CAN_IE_ARAE_Msk                       (_U_(0x1) << CAN_IE_ARAE_Pos)                        /**< (CAN_IE) Access to Reserved Address Enable Mask */
#define CAN_IE_ARAE(value)                    (CAN_IE_ARAE_Msk & ((value) << CAN_IE_ARAE_Pos))    
#define CAN_IE_Msk                            _U_(0x3FFFFFFF)                                      /**< (CAN_IE) Register Mask  */


/* -------- CAN_ILS : (CAN Offset: 0x58) (R/W 32) Interrupt Line Select -------- */
#define CAN_ILS_RESETVALUE                    _U_(0x00)                                            /**<  (CAN_ILS) Interrupt Line Select  Reset Value */

