Microchip-MPLAB-Harmony/csp/apps/ccl/manchester_encoder/firmware/src/packs/ATSAMC21N18A_DFP/component/can.h
#define CAN_TXBAR_AR0_Pos                     _U_(0)                                               /**< (CAN_TXBAR) Add Request 0 Position */
#define CAN_TXBAR_AR0_Msk                     (_U_(0x1) << CAN_TXBAR_AR0_Pos)                      /**< (CAN_TXBAR) Add Request 0 Mask */
#define CAN_TXBAR_AR0(value)                  (CAN_TXBAR_AR0_Msk & ((value) << CAN_TXBAR_AR0_Pos))
#define CAN_TXBAR_AR1_Pos                     _U_(1)                                               /**< (CAN_TXBAR) Add Request 1 Position */
#define CAN_TXBAR_AR1_Msk                     (_U_(0x1) << CAN_TXBAR_AR1_Pos)                      /**< (CAN_TXBAR) Add Request 1 Mask */
#define CAN_TXBAR_AR1(value)                  (CAN_TXBAR_AR1_Msk & ((value) << CAN_TXBAR_AR1_Pos))
#define CAN_TXBAR_AR2_Pos                     _U_(2)                                               /**< (CAN_TXBAR) Add Request 2 Position */
#define CAN_TXBAR_AR2_Msk                     (_U_(0x1) << CAN_TXBAR_AR2_Pos)                      /**< (CAN_TXBAR) Add Request 2 Mask */
#define CAN_TXBAR_AR2(value)                  (CAN_TXBAR_AR2_Msk & ((value) << CAN_TXBAR_AR2_Pos))
#define CAN_TXBAR_AR3_Pos                     _U_(3)                                               /**< (CAN_TXBAR) Add Request 3 Position */
#define CAN_TXBAR_AR3_Msk                     (_U_(0x1) << CAN_TXBAR_AR3_Pos)                      /**< (CAN_TXBAR) Add Request 3 Mask */
#define CAN_TXBAR_AR3(value)                  (CAN_TXBAR_AR3_Msk & ((value) << CAN_TXBAR_AR3_Pos))
#define CAN_TXBAR_AR4_Pos                     _U_(4)                                               /**< (CAN_TXBAR) Add Request 4 Position */
#define CAN_TXBAR_AR4_Msk                     (_U_(0x1) << CAN_TXBAR_AR4_Pos)                      /**< (CAN_TXBAR) Add Request 4 Mask */
#define CAN_TXBAR_AR4(value)                  (CAN_TXBAR_AR4_Msk & ((value) << CAN_TXBAR_AR4_Pos))
#define CAN_TXBAR_AR5_Pos                     _U_(5)                                               /**< (CAN_TXBAR) Add Request 5 Position */
#define CAN_TXBAR_AR5_Msk                     (_U_(0x1) << CAN_TXBAR_AR5_Pos)                      /**< (CAN_TXBAR) Add Request 5 Mask */
#define CAN_TXBAR_AR5(value)                  (CAN_TXBAR_AR5_Msk & ((value) << CAN_TXBAR_AR5_Pos))
#define CAN_TXBAR_AR6_Pos                     _U_(6)                                               /**< (CAN_TXBAR) Add Request 6 Position */
#define CAN_TXBAR_AR6_Msk                     (_U_(0x1) << CAN_TXBAR_AR6_Pos)                      /**< (CAN_TXBAR) Add Request 6 Mask */
#define CAN_TXBAR_AR6(value)                  (CAN_TXBAR_AR6_Msk & ((value) << CAN_TXBAR_AR6_Pos))
#define CAN_TXBAR_AR7_Pos                     _U_(7)                                               /**< (CAN_TXBAR) Add Request 7 Position */
#define CAN_TXBAR_AR7_Msk                     (_U_(0x1) << CAN_TXBAR_AR7_Pos)                      /**< (CAN_TXBAR) Add Request 7 Mask */
#define CAN_TXBAR_AR7(value)                  (CAN_TXBAR_AR7_Msk & ((value) << CAN_TXBAR_AR7_Pos))
#define CAN_TXBAR_AR8_Pos                     _U_(8)                                               /**< (CAN_TXBAR) Add Request 8 Position */
#define CAN_TXBAR_AR8_Msk                     (_U_(0x1) << CAN_TXBAR_AR8_Pos)                      /**< (CAN_TXBAR) Add Request 8 Mask */
#define CAN_TXBAR_AR8(value)                  (CAN_TXBAR_AR8_Msk & ((value) << CAN_TXBAR_AR8_Pos))
#define CAN_TXBAR_AR9_Pos                     _U_(9)                                               /**< (CAN_TXBAR) Add Request 9 Position */
#define CAN_TXBAR_AR9_Msk                     (_U_(0x1) << CAN_TXBAR_AR9_Pos)                      /**< (CAN_TXBAR) Add Request 9 Mask */
#define CAN_TXBAR_AR9(value)                  (CAN_TXBAR_AR9_Msk & ((value) << CAN_TXBAR_AR9_Pos))
#define CAN_TXBAR_AR10_Pos                    _U_(10)                                              /**< (CAN_TXBAR) Add Request 10 Position */
#define CAN_TXBAR_AR10_Msk                    (_U_(0x1) << CAN_TXBAR_AR10_Pos)                     /**< (CAN_TXBAR) Add Request 10 Mask */
#define CAN_TXBAR_AR10(value)                 (CAN_TXBAR_AR10_Msk & ((value) << CAN_TXBAR_AR10_Pos))
#define CAN_TXBAR_AR11_Pos                    _U_(11)                                              /**< (CAN_TXBAR) Add Request 11 Position */
#define CAN_TXBAR_AR11_Msk                    (_U_(0x1) << CAN_TXBAR_AR11_Pos)                     /**< (CAN_TXBAR) Add Request 11 Mask */
#define CAN_TXBAR_AR11(value)                 (CAN_TXBAR_AR11_Msk & ((value) << CAN_TXBAR_AR11_Pos))
#define CAN_TXBAR_AR12_Pos                    _U_(12)                                              /**< (CAN_TXBAR) Add Request 12 Position */
#define CAN_TXBAR_AR12_Msk                    (_U_(0x1) << CAN_TXBAR_AR12_Pos)                     /**< (CAN_TXBAR) Add Request 12 Mask */
#define CAN_TXBAR_AR12(value)                 (CAN_TXBAR_AR12_Msk & ((value) << CAN_TXBAR_AR12_Pos))
#define CAN_TXBAR_AR13_Pos                    _U_(13)                                              /**< (CAN_TXBAR) Add Request 13 Position */
#define CAN_TXBAR_AR13_Msk                    (_U_(0x1) << CAN_TXBAR_AR13_Pos)                     /**< (CAN_TXBAR) Add Request 13 Mask */
#define CAN_TXBAR_AR13(value)                 (CAN_TXBAR_AR13_Msk & ((value) << CAN_TXBAR_AR13_Pos))
#define CAN_TXBAR_AR14_Pos                    _U_(14)                                              /**< (CAN_TXBAR) Add Request 14 Position */
#define CAN_TXBAR_AR14_Msk                    (_U_(0x1) << CAN_TXBAR_AR14_Pos)                     /**< (CAN_TXBAR) Add Request 14 Mask */
#define CAN_TXBAR_AR14(value)                 (CAN_TXBAR_AR14_Msk & ((value) << CAN_TXBAR_AR14_Pos))
#define CAN_TXBAR_AR15_Pos                    _U_(15)                                              /**< (CAN_TXBAR) Add Request 15 Position */
#define CAN_TXBAR_AR15_Msk                    (_U_(0x1) << CAN_TXBAR_AR15_Pos)                     /**< (CAN_TXBAR) Add Request 15 Mask */
#define CAN_TXBAR_AR15(value)                 (CAN_TXBAR_AR15_Msk & ((value) << CAN_TXBAR_AR15_Pos))
#define CAN_TXBAR_AR16_Pos                    _U_(16)                                              /**< (CAN_TXBAR) Add Request 16 Position */
#define CAN_TXBAR_AR16_Msk                    (_U_(0x1) << CAN_TXBAR_AR16_Pos)                     /**< (CAN_TXBAR) Add Request 16 Mask */
#define CAN_TXBAR_AR16(value)                 (CAN_TXBAR_AR16_Msk & ((value) << CAN_TXBAR_AR16_Pos))
#define CAN_TXBAR_AR17_Pos                    _U_(17)                                              /**< (CAN_TXBAR) Add Request 17 Position */
#define CAN_TXBAR_AR17_Msk                    (_U_(0x1) << CAN_TXBAR_AR17_Pos)                     /**< (CAN_TXBAR) Add Request 17 Mask */
#define CAN_TXBAR_AR17(value)                 (CAN_TXBAR_AR17_Msk & ((value) << CAN_TXBAR_AR17_Pos))
#define CAN_TXBAR_AR18_Pos                    _U_(18)                                              /**< (CAN_TXBAR) Add Request 18 Position */
#define CAN_TXBAR_AR18_Msk                    (_U_(0x1) << CAN_TXBAR_AR18_Pos)                     /**< (CAN_TXBAR) Add Request 18 Mask */
#define CAN_TXBAR_AR18(value)                 (CAN_TXBAR_AR18_Msk & ((value) << CAN_TXBAR_AR18_Pos))
#define CAN_TXBAR_AR19_Pos                    _U_(19)                                              /**< (CAN_TXBAR) Add Request 19 Position */
#define CAN_TXBAR_AR19_Msk                    (_U_(0x1) << CAN_TXBAR_AR19_Pos)                     /**< (CAN_TXBAR) Add Request 19 Mask */
#define CAN_TXBAR_AR19(value)                 (CAN_TXBAR_AR19_Msk & ((value) << CAN_TXBAR_AR19_Pos))
#define CAN_TXBAR_AR20_Pos                    _U_(20)                                              /**< (CAN_TXBAR) Add Request 20 Position */
#define CAN_TXBAR_AR20_Msk                    (_U_(0x1) << CAN_TXBAR_AR20_Pos)                     /**< (CAN_TXBAR) Add Request 20 Mask */
#define CAN_TXBAR_AR20(value)                 (CAN_TXBAR_AR20_Msk & ((value) << CAN_TXBAR_AR20_Pos))
#define CAN_TXBAR_AR21_Pos                    _U_(21)                                              /**< (CAN_TXBAR) Add Request 21 Position */
#define CAN_TXBAR_AR21_Msk                    (_U_(0x1) << CAN_TXBAR_AR21_Pos)                     /**< (CAN_TXBAR) Add Request 21 Mask */
#define CAN_TXBAR_AR21(value)                 (CAN_TXBAR_AR21_Msk & ((value) << CAN_TXBAR_AR21_Pos))
#define CAN_TXBAR_AR22_Pos                    _U_(22)                                              /**< (CAN_TXBAR) Add Request 22 Position */
#define CAN_TXBAR_AR22_Msk                    (_U_(0x1) << CAN_TXBAR_AR22_Pos)                     /**< (CAN_TXBAR) Add Request 22 Mask */
#define CAN_TXBAR_AR22(value)                 (CAN_TXBAR_AR22_Msk & ((value) << CAN_TXBAR_AR22_Pos))
#define CAN_TXBAR_AR23_Pos                    _U_(23)                                              /**< (CAN_TXBAR) Add Request 23 Position */
#define CAN_TXBAR_AR23_Msk                    (_U_(0x1) << CAN_TXBAR_AR23_Pos)                     /**< (CAN_TXBAR) Add Request 23 Mask */
#define CAN_TXBAR_AR23(value)                 (CAN_TXBAR_AR23_Msk & ((value) << CAN_TXBAR_AR23_Pos))
#define CAN_TXBAR_AR24_Pos                    _U_(24)                                              /**< (CAN_TXBAR) Add Request 24 Position */
#define CAN_TXBAR_AR24_Msk                    (_U_(0x1) << CAN_TXBAR_AR24_Pos)                     /**< (CAN_TXBAR) Add Request 24 Mask */
#define CAN_TXBAR_AR24(value)                 (CAN_TXBAR_AR24_Msk & ((value) << CAN_TXBAR_AR24_Pos))
#define CAN_TXBAR_AR25_Pos                    _U_(25)                                              /**< (CAN_TXBAR) Add Request 25 Position */
#define CAN_TXBAR_AR25_Msk                    (_U_(0x1) << CAN_TXBAR_AR25_Pos)                     /**< (CAN_TXBAR) Add Request 25 Mask */
#define CAN_TXBAR_AR25(value)                 (CAN_TXBAR_AR25_Msk & ((value) << CAN_TXBAR_AR25_Pos))
#define CAN_TXBAR_AR26_Pos                    _U_(26)                                              /**< (CAN_TXBAR) Add Request 26 Position */
#define CAN_TXBAR_AR26_Msk                    (_U_(0x1) << CAN_TXBAR_AR26_Pos)                     /**< (CAN_TXBAR) Add Request 26 Mask */
#define CAN_TXBAR_AR26(value)                 (CAN_TXBAR_AR26_Msk & ((value) << CAN_TXBAR_AR26_Pos))
#define CAN_TXBAR_AR27_Pos                    _U_(27)                                              /**< (CAN_TXBAR) Add Request 27 Position */
#define CAN_TXBAR_AR27_Msk                    (_U_(0x1) << CAN_TXBAR_AR27_Pos)                     /**< (CAN_TXBAR) Add Request 27 Mask */
#define CAN_TXBAR_AR27(value)                 (CAN_TXBAR_AR27_Msk & ((value) << CAN_TXBAR_AR27_Pos))
#define CAN_TXBAR_AR28_Pos                    _U_(28)                                              /**< (CAN_TXBAR) Add Request 28 Position */
#define CAN_TXBAR_AR28_Msk                    (_U_(0x1) << CAN_TXBAR_AR28_Pos)                     /**< (CAN_TXBAR) Add Request 28 Mask */
#define CAN_TXBAR_AR28(value)                 (CAN_TXBAR_AR28_Msk & ((value) << CAN_TXBAR_AR28_Pos))
#define CAN_TXBAR_AR29_Pos                    _U_(29)                                              /**< (CAN_TXBAR) Add Request 29 Position */
#define CAN_TXBAR_AR29_Msk                    (_U_(0x1) << CAN_TXBAR_AR29_Pos)                     /**< (CAN_TXBAR) Add Request 29 Mask */
#define CAN_TXBAR_AR29(value)                 (CAN_TXBAR_AR29_Msk & ((value) << CAN_TXBAR_AR29_Pos))
#define CAN_TXBAR_AR30_Pos                    _U_(30)                                              /**< (CAN_TXBAR) Add Request 30 Position */
#define CAN_TXBAR_AR30_Msk                    (_U_(0x1) << CAN_TXBAR_AR30_Pos)                     /**< (CAN_TXBAR) Add Request 30 Mask */
#define CAN_TXBAR_AR30(value)                 (CAN_TXBAR_AR30_Msk & ((value) << CAN_TXBAR_AR30_Pos))
#define CAN_TXBAR_AR31_Pos                    _U_(31)                                              /**< (CAN_TXBAR) Add Request 31 Position */
#define CAN_TXBAR_AR31_Msk                    (_U_(0x1) << CAN_TXBAR_AR31_Pos)                     /**< (CAN_TXBAR) Add Request 31 Mask */
#define CAN_TXBAR_AR31(value)                 (CAN_TXBAR_AR31_Msk & ((value) << CAN_TXBAR_AR31_Pos))
#define CAN_TXBAR_Msk                         _U_(0xFFFFFFFF)                                      /**< (CAN_TXBAR) Register Mask  */

